## 21CE133

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("apartments_for_rent_classified_10K.csv", encoding='latin1', delimiter=';')
#read file

In [3]:
df.head()

,id,category,title,body,amenities,bathrooms,bedrooms,currency,fee,has_photo,...,price_display,price_type,square_feet,address,cityname,state,latitude,longitude,source,time
0,5668626895,housing/rent/apartment,"Studio apartment 2nd St NE, Uhland Terrace NE,...","This unit is located at second St NE, Uhland T...",NaN,NaN,0.0,USD,No,Thumbnail,...,$790,Monthly,101,NaN,Washington,DC,38.9057,-76.9861,RentLingo,1577359415
1,5664597177,housing/rent/apartment,Studio apartment 814 Schutte Road,"This unit is located at 814 Schutte Road, Evan...",NaN,NaN,1.0,USD,No,Thumbnail,...,$425,Monthly,106,814 Schutte Rd,Evansville,IN,37.9680,-87.6621,RentLingo,1577017063
2,5668626833,housing/rent/apartment,"Studio apartment N Scott St, 14th St N, Arling...","This unit is located at N Scott St, 14th St N,...",NaN,1.0,0.0,USD,No,Thumbnail,...,"$1,390",Monthly,107,NaN,Arlington,VA,38.8910,-77.0816,RentLingo,1577359410
3,5659918074,housing/rent/apartment,Studio apartment 1717 12th Ave,"This unit is located at 1717 12th Ave, Seattle...",NaN,1.0,0.0,USD,No,Thumbnail,...,$925,Monthly,116,1717 12th Avenue,Seattle,WA,47.6160,-122.3275,RentLingo,1576667743
4,5668626759,housing/rent/apartment,"Studio apartment Washington Blvd, N Cleveland ...","This unit is located at Washington Blvd, N Cle...",NaN,NaN,0.0,USD,No,Thumbnail,...,$880,Monthly,125,NaN,Arlington,VA,38.8738,-77.1055,RentLingo,1577359401

In [4]:
df.columns

Index(['id', 'category', 'title', 'body', 'amenities', 'bathrooms', 'bedrooms',
       'currency', 'fee', 'has_photo', 'pets_allowed', 'price',
       'price_display', 'price_type', 'square_feet', 'address', 'cityname',
       'state', 'latitude', 'longitude', 'source', 'time'],
      dtype='object')

In [5]:
selected_columns = ['bathrooms', 'bedrooms', 'square_feet', 'cityname', 'price']

# Create a new DataFrame with only the selected columns
df = df[selected_columns]
df.head()

   bathrooms  bedrooms  square_feet    cityname  price
0        NaN       0.0          101  Washington    790
1        NaN       1.0          106  Evansville    425
2        1.0       0.0          107   Arlington   1390
3        1.0       0.0          116     Seattle    925
4        NaN       0.0          125   Arlington    880

In [6]:
df.isnull().sum()

bathrooms      34
bedrooms        7
square_feet     0
cityname       77
price           0
dtype: int64

In [7]:
df = df.dropna() #droping null

In [8]:
df.isnull().sum()

bathrooms      0
bedrooms       0
square_feet    0
cityname       0
price          0
dtype: int64

In [9]:
df.shape

(9883, 5)

In [10]:
df.isnull().sum()

bathrooms      0
bedrooms       0
square_feet    0
cityname       0
price          0
dtype: int64

In [11]:
df.describe()

         bathrooms     bedrooms   square_feet         price
count  9883.000000  9883.000000   9883.000000   9883.000000
mean      1.380552     1.747040    943.237580   1486.954670
std       0.616038     0.941714    527.162123   1078.622808
min       1.000000     0.000000    107.000000    200.000000
25%       1.000000     1.000000    650.000000    949.000000
50%       1.000000     2.000000    803.000000   1275.000000
75%       2.000000     2.000000   1100.000000   1695.000000
max       8.500000     9.000000  11318.000000  52500.000000

In [12]:
df

      bathrooms  bedrooms  square_feet       cityname  price
2           1.0       0.0          107      Arlington   1390
3           1.0       0.0          116        Seattle    925
5           1.0       0.0          130      Manhattan   2475
8           1.0       0.0          138  San Francisco   1495
14          1.0       0.0          190  San Francisco   1695
...         ...       ...          ...            ...    ...
9994        4.0       6.0         5921   Saint George   3000
9995        4.0       5.0         6300          Edina   6000
9996        8.0       6.0         8716      Montecito  25000
9997        8.5       6.0        11318        Potomac  11000
9999        1.0       1.0          880  Lawrenceville   1009

[9883 rows x 5 columns]

In [13]:
df.cityname.unique()

array(['Arlington', 'Seattle', 'Manhattan', ..., 'Saint Leonard',
       'Chaska', 'Bella Vista'], dtype=object)

In [14]:
df.cityname = df.cityname.apply(lambda x: x.strip())
loction_stats = df.groupby('cityname')['cityname'].agg('count').sort_values(ascending=False)
loction_stats
#Examine locations which is a categorical variable. We need to apply dimensionality reduction technique here to reduce number of locations

cityname
Austin         522
Dallas         215
Houston        186
San Antonio    182
Los Angeles    165
              ...
Del Mar          1
Pennsauken       1
Leon Valley      1
Buckeye          1
Penns Grove      1
Name: cityname, Length: 1572, dtype: int64

In [15]:
len(loction_stats[loction_stats<=10])

1395

In [16]:
loction_stats_less_than_10 = loction_stats[loction_stats<=10]
loction_stats_less_than_10
#Any location having less than 10 data points should be tagged as "other" location. This way number of categories can be reduced by huge amount. Later on when we do one hot encoding, it will help us with having fewer dummy columns

cityname
Cambridge      10
Shreveport     10
Flanders       10
Memphis        10
Sacramento     10
               ..
Del Mar         1
Pennsauken      1
Leon Valley     1
Buckeye         1
Penns Grove     1
Name: cityname, Length: 1395, dtype: int64

In [17]:
len(df.cityname.unique())

1572

In [18]:
df.cityname = df.cityname.apply(lambda x: 'other' if x in loction_stats_less_than_10 else x)
len(df.cityname.unique())

178

In [19]:
df.shape

(9883, 5)

In [20]:
df[df.square_feet/df.bedrooms<250].head()# we cannot justify a bedroom have area<250 sqft

    bathrooms  bedrooms  square_feet  cityname  price
15        1.0       1.0          200     other   1560
16        1.0       1.0          200     other   1560
17        1.0       1.0          200    Spring   1000
18        1.0       1.0          200     other    950
19        1.0       1.0          200  Marietta    625

In [21]:
df.shape

(9883, 5)

In [22]:
zero_bed_rows = df[df['bedrooms'] == 0]
print(len(zero_bed_rows))

184

In [23]:
df[df.square_feet/df.bedrooms<250].shape #how many row with 250 sqft

(399, 5)

In [24]:
df1 = df[~(df.square_feet/df.bedrooms<250)]
df1.shape

(9484, 5)

In [25]:
df1.square_feet.describe()

count     9484.000000
mean       963.476276
std        527.998723
min        107.000000
25%        663.000000
50%        825.000000
75%       1113.250000
max      11318.000000
Name: square_feet, dtype: float64

In [26]:
df1.isnull().sum()

bathrooms      0
bedrooms       0
square_feet    0
cityname       0
price          0
dtype: int64

In [27]:
df2 = df1.copy() # calculating price oer sqft
df2['price_per_sqft'] = df2['price']*100000/df2['square_feet']
df2.head()

    bathrooms  bedrooms  square_feet       cityname  price  price_per_sqft
2         1.0       0.0          107      Arlington   1390    1.299065e+06
3         1.0       0.0          116        Seattle    925    7.974138e+05
5         1.0       0.0          130          other   2475    1.903846e+06
8         1.0       0.0          138  San Francisco   1495    1.083333e+06
14        1.0       0.0          190  San Francisco   1695    8.921053e+05

In [28]:
#one standerd deviation
#per location mean and standerd deviation
#filter out data which are beyond this deviation
def remove_pps_outliers(df):
    df_out = pd.DataFrame()
    for key, subdf in df.groupby('cityname'):
        m = np.mean(subdf.price_per_sqft)#mean
        st = np.std(subdf.price_per_sqft)#sandered deviation
        reduced_df = subdf[(subdf.price_per_sqft>(m-st)) & (subdf.price_per_sqft<=(m+st))]
        #beyond the deviation
        df_out = pd.concat([df_out,reduced_df],ignore_index=True)
    return df_out
df7 = remove_pps_outliers(df2)
df7.shape

(7478, 6)

In [29]:
df7 = df7[df7['bedrooms'] > 0] #removing row with 0 bedroom

In [30]:
df7

      bathrooms  bedrooms  square_feet     cityname  price  price_per_sqft
0           1.0       1.0          535  Albuquerque    750   140186.915888
1           1.0       1.0          535  Albuquerque    750   140186.915888
2           1.0       1.0          562  Albuquerque    685   121886.120996
3           1.0       1.0          622  Albuquerque    739   118810.289389
4           1.0       1.0          656  Albuquerque    815   124237.804878
...         ...       ...          ...          ...    ...             ...
7473        3.5       5.0         4970        other   3980    80080.482897
7474        5.0       4.0         5407        other   4500    83225.448493
7475        5.0       5.0         5700        other   6900   121052.631579
7476        4.0       5.0         6300        other   6000    95238.095238
7477        8.5       6.0        11318        other  11000    97190.316310

[7382 rows x 6 columns]

In [31]:
# Look for outliers in square_feet and price
sqft_mean = df7['square_feet'].mean()
sqft_std = df7['square_feet'].std()
price_mean = df7['price'].mean()
price_std = df7['price'].std()

df7 = df7[(np.abs(df7['square_feet'] - sqft_mean) < (3 * sqft_std)) & 
        (np.abs(df7['price'] - price_mean) < (3 * price_std))]

# Check ranges
df7 = df7[(df7['bathrooms'] >= 0) &
        (df7['bedrooms'] >= 0) &
        (df7['square_feet'] > 0) &
        (df7['price'] > 0)]

# Log transform skewed data
df7['price'] = np.log(df7['price']) 

# Remove any remaining outliers
df7 = df7[df7['price'] < df7['price'].mean() + 3*df7['price'].std()]

df7.shape

(7163, 6)

In [32]:
df7.describe()

         bathrooms     bedrooms  square_feet        price  price_per_sqft
count  7163.000000  7163.000000  7163.000000  7163.000000     7163.000000
mean      1.368072     1.698311   926.988552     7.134313   155842.344182
std       0.549088     0.823341   358.819539     0.401329    67307.910101
min       1.000000     1.000000   250.000000     5.298317    52002.464572
25%       1.000000     1.000000   682.000000     6.855409   109870.235426
50%       1.000000     2.000000   830.000000     7.130899   142556.770395
75%       2.000000     2.000000  1100.000000     7.383989   186111.111111
max       5.000000     6.000000  2455.000000     8.281471   716435.185185

In [33]:
df7 = df7.dropna(subset=['cityname'])

In [34]:
df7.shape

(7163, 6)

In [35]:
df7

      bathrooms  bedrooms  square_feet     cityname     price  price_per_sqft
0           1.0       1.0          535  Albuquerque  6.620073   140186.915888
1           1.0       1.0          535  Albuquerque  6.620073   140186.915888
2           1.0       1.0          562  Albuquerque  6.529419   121886.120996
3           1.0       1.0          622  Albuquerque  6.605298   118810.289389
4           1.0       1.0          656  Albuquerque  6.703188   124237.804878
...         ...       ...          ...          ...       ...             ...
7364        2.5       3.0         2441        other  8.070906   131093.814011
7365        2.0       3.0         2446        other  7.345365    63327.882257
7366        3.5       4.0         2447        other  7.673223    87862.689007
7368        2.0       6.0         2454        other  7.663877    86797.066015
7369        3.0       4.0         2455        other  7.693937    89409.368635

[7163 rows x 6 columns]

In [36]:
#this converts a categorical column to a numeric, dummy encoded representation suitable for many machine learning models. The NaN handling and astype(int) give us an clean 0/1 encoding.

dummies = pd.get_dummies(df7['cityname'], dummy_na=True) 
dummies = dummies.astype(int)
print(dummies.head(3))

   Albuquerque  Alexandria  Alpharetta  Ames  Anaheim  Anchorage  Ann Arbor  \
0            1           0           0     0        0          0          0
1            1           0           0     0        0          0          0
2            1           0           0     0        0          0          0

   Apex  Arlington  Atlanta  ...  Vancouver  Virginia Beach  Washington  \
0     0          0        0  ...          0               0           0
1     0          0        0  ...          0               0           0
2     0          0        0  ...          0               0           0

   West Des Moines  West Hollywood  West Lafayette  West New York  \
0                0               0               0              0
1                0               0               0              0
2                0               0               0              0

   Winston Salem  other  NaN
0              0      0    0
1              0      0    0
2              0      0    0

[3 rows x 179 columns]

In [37]:
df8 = pd.concat([df7,dummies.drop('other', axis= 'columns')], axis = 'columns') #adding city in unique form of 0 and 1
df8.head()

,bathrooms,bedrooms,square_feet,cityname,price,price_per_sqft,Albuquerque,Alexandria,Alpharetta,Ames,...,Urbana,Vancouver,Virginia Beach,Washington,West Des Moines,West Hollywood,West Lafayette,West New York,Winston Salem,NaN
0,1.0,1.0,535,Albuquerque,6.620073,140186.915888,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,1.0,1.0,535,Albuquerque,6.620073,140186.915888,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,1.0,1.0,562,Albuquerque,6.529419,121886.120996,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,1.0,1.0,622,Albuquerque,6.605298,118810.289389,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,1.0,1.0,656,Albuquerque,6.703188,124237.804878,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [38]:
df9 = df8.drop('cityname',axis = 'columns') #now no need of cityname
df9.head()

,bathrooms,bedrooms,square_feet,price,price_per_sqft,Albuquerque,Alexandria,Alpharetta,Ames,Anaheim,...,Urbana,Vancouver,Virginia Beach,Washington,West Des Moines,West Hollywood,West Lafayette,West New York,Winston Salem,NaN
0,1.0,1.0,535,6.620073,140186.915888,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,1.0,1.0,535,6.620073,140186.915888,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,1.0,1.0,562,6.529419,121886.120996,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,1.0,1.0,622,6.605298,118810.289389,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,1.0,1.0,656,6.703188,124237.804878,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [39]:
selected_columns = ['bathrooms', 'bedrooms', 'square_feet']
# Create a new DataFrame with only the selected columns
features = df9.drop('price',axis='columns')
target = df9['price']

In [40]:
#importing library
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.metrics import f1_score

In [41]:
X_train, X_test, y_train, y_test = train_test_split(features, target, test_size=0.2, random_state=30)

In [42]:
# Fit linear regression model
model = LinearRegression()
model.fit(X_train, y_train)

LinearRegression()

In [43]:
# Make predictions on test set
y_pred = model.predict(X_test)

In [44]:
model.score(X_test,y_test)

0.9167283648645332

In [45]:
from sklearn.metrics import f1_score

from sklearn.metrics import median_absolute_error

# Calculate median of y_true
median = np.median(y_test)  


# Bin into 2 classes 
y_test = (y_test > median).astype(int)
y_pred= (y_pred > median).astype(int)

f1 = f1_score(y_test, y_pred)

In [46]:
f1

0.9238578680203046